Revit 2024 API
ClassificationEntry Constructor
 Constructs a ClassificationEntry object
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ClassificationEntry(
	string key,
	string parentKey,
	string description,
	int level,
	ElementId categoryId
)
Visual Basic
Public Sub New ( _
	key As String, _
	parentKey As String, _
	description As String, _
	level As Integer, _
	categoryId As ElementId _
)
Visual C++
public:
ClassificationEntry(
	String^ key,
	String^ parentKey,
	String^ description,
	int level,
	ElementId^ categoryId
)
Parameters
key
Type: System.String
 The key of this ClassificationEntry.
parentKey
Type: System.String
 The parent key of this ClassificationEntry.
description
Type: System.String
 The description associated with this ClassificationEntry.
level
Type: System.Int32
 The level of this ClassficationEntry.
categoryId
Type: Autodesk.Revit.DB.ElementId
 The category id of this ClassificationEntry. The category can be invalidElementId, otherwise it must represent Revit existing category.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  key is an empty string. -or- The categoryId is not appropriate category id for classfication entry.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ClassificationEntry Class
Autodesk.Revit.DB Namespace